a = str(input("введи ЦИФРАМИ дату своего рождения(пример: дата.месяц.год): "))
a_spl = a.split(".")
if a_spl[1] == "12" or a_spl[1] == "01" or  a_spl[1] == "02":
    print("За окном падал белый снег")
elif a_spl[1] == "03" or a_spl[1] == "04" or  a_spl[1] == "05":
    print("Птицы пели прекрасные песни")
elif a_spl[1] == "06" or a_spl[1] == "07" or  a_spl[1] == "08":
    print("Солнце светило ярче, чем когда-либо")
elif a_spl[1] == "09" or a_spl[1] == "10" or  a_spl[1] == "11":
    print("Урожай был невероятным")
else:
    print("данные введены неверно")
